## Libraries

In [1]:
# Importing pandas with an alias
import pandas as pd

## Creating DataFrames

In [8]:
# Simple creation of DataFrame1
df1 = pd.DataFrame({"name": ["Caio", "Rodrigo", "Evandro", "Rafael"],
                     "age": [28, 45, 27, 16]})
df1

      name  age
0     Caio   28
1  Rodrigo   45
2  Evandro   27
3   Rafael   16

In [9]:
# Simple creation of a DataFrame2
df2 = pd.DataFrame({"name": ["Caio", "Mariane", "Maria"],
                     "age": [28, 29, 59]})
df2

      name  age
0     Caio   28
1  Mariane   29
2    Maria   59

## CONCAT simulating SQL UNION ALL

In [10]:
# Using concat() function to union DataFrame1 and DataFrame2, ignoring their indexes
df = pd.concat([df1, df2], ignore_index=True)
df

      name  age
0     Caio   28
1  Rodrigo   45
2  Evandro   27
3   Rafael   16
4     Caio   28
5  Mariane   29
6    Maria   59

In [11]:
# Using reset_index() function to ignore their indexes (option without ignore_index in concat())
df.reset_index(drop=True, inplace=True)
df

      name  age
0     Caio   28
1  Rodrigo   45
2  Evandro   27
3   Rafael   16
4     Caio   28
5  Mariane   29
6    Maria   59

## CONCAT simulating SQL UNION

In [14]:
# Using concat() function to union DataFrame1 and DataFrame2, using drop_duplicates() function to simulate SQL UNION)
DF = pd.concat([df1, df2]).drop_duplicates().reset_index(drop=True)
DF

      name  age
0     Caio   28
1  Rodrigo   45
2  Evandro   27
3   Rafael   16
4  Mariane   29
5    Maria   59